EDT/МПСтриж/src/InformationRegisters/УведомленияЭкипажу/УведомленияЭкипажу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УведомленияЭкипажу</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаУведомления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипУведомления</name>
    <type>
      <types>EnumRef.ТипыУведомленийЭкипажу</types>
    </type>
  </resources>
  <resources>
    <name>УведомлениеПоказано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Транспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/МПСтриж/src/Enums/ТипыУведомленийЭкипажу/ТипыУведомленийЭкипажу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУведомленийЭкипажу</name>
  <enumValues>
    <name>НастройкаТелефона</name>
  </enumValues>
</mdclass:Enum>

EDT/МПСтриж/src/CommonModules/ИнформированиеЭкипажейСервер/Module.bsl
Функция ЕстьНепогашенноеУведомление() Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	УведомленияЭкипажуСрезПоследних.Период КАК Период
	            |ИЗ
	            |	РегистрСведений.УведомленияЭкипажу.СрезПоследних(, Транспорт = &ВыбТранспорт) КАК УведомленияЭкипажуСрезПоследних
	            |ГДЕ
	            |	УведомленияЭкипажуСрезПоследних.ДатаУведомления = &ДатаУведомления
	            |	И УведомленияЭкипажуСрезПоследних.ТипУведомления = ЗНАЧЕНИЕ(Перечисление.ТипыУведомленийЭкипажу.НастройкаТелефона)
	            |	И УведомленияЭкипажуСрезПоследних.УведомлениеПоказано = ЛОЖЬ";
	Зап.УстановитьПараметр("ДатаУведомления", НачалоДня(ТекущаяДата()));
	Зап.УстановитьПараметр("ВыбТранспорт", Константы.Транспорт.Получить());
	
	Возврат Не Зап.Выполнить().Пустой();
КонецФункции

Функция ПогаситьУведомление(ДатаУведомления) Экспорт
	Наб = РегистрыСведений.УведомленияЭкипажу.СоздатьНаборЗаписей();
	
	ТекВр = ТекущаяДата();
	Транспорт = Константы.Транспорт.Получить();
	
	Наб.Отбор.Период.Установить(ТекВр);
	Наб.Отбор.Транспорт.Установить(Транспорт);
	
	Нов = Наб.Добавить();
	
	Нов.Период = ТекВр;
	Нов.Транспорт = Транспорт;
	Нов.ДатаУведомления = НачалоДня(ДатаУведомления);
	Нов.УведомлениеПоказано = Истина;
	Нов.ТипУведомления = Перечисления.ТипыУведомленийЭкипажу.НастройкаТелефона;
	
	Наб.Записать();
КонецФункции
